Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Terraform plans
<details><summary>libp2p</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # github_repository_collaborator.this["go-libp2p:aschmahmann"] will be created
  + resource "github_repository_collaborator" "this" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "admin"
      + permission_diff_suppression = false
      + repository                  = "go-libp2p"
      + username                    = "aschmahmann"
    }

  # github_repository_collaborator.this["go-libp2p:marcopolo"] will be created
  + resource "github_repository_collaborator" "this" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "admin"
      + permission_diff_suppression = false
      + repository                  = "go-libp2p"
      + username                    = "MarcoPolo"
    }

  # github_repository_collaborator.this["go-libp2p:stebalien"] will be created
  + resource "github_repository_collaborator" "this" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "admin"
      + permission_diff_suppression = false
      + repository                  = "go-libp2p"
      + username                    = "Stebalien"
    }

  # github_repository_collaborator.this["go-libp2p:sukunrt"] will be created
  + resource "github_repository_collaborator" "this" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "admin"
      + permission_diff_suppression = false
      + repository                  = "go-libp2p"
      + username                    = "sukunrt"
    }

  # github_repository_collaborator.this["js-libp2p:achingbrain"] will be created
  + resource "github_repository_collaborator" "this" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "admin"
      + permission_diff_suppression = false
      + repository                  = "js-libp2p"
      + username                    = "achingbrain"
    }

  # github_repository_collaborator.this["js-libp2p:aschmahmann"] will be created
  + resource "github_repository_collaborator" "this" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "admin"
      + permission_diff_suppression = false
      + repository                  = "js-libp2p"
      + username                    = "aschmahmann"
    }

  # github_repository_collaborator.this["js-libp2p:marcopolo"] will be created
  + resource "github_repository_collaborator" "this" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "admin"
      + permission_diff_suppression = false
      + repository                  = "js-libp2p"
      + username                    = "MarcoPolo"
    }

  # github_team.this["shipyard"] will be created
  + resource "github_team" "this" {
      + create_default_maintainer = false
      + description               = "Members of Interplanetary Shipyard who work with or on libp2p"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "shipyard"
      + node_id                   = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team_membership.this["shipyard:2color"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "2color"
    }

  # github_team_membership.this["shipyard:achingbrain"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "achingbrain"
    }

  # github_team_membership.this["shipyard:aschmahmann"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "aschmahmann"
    }

  # github_team_membership.this["shipyard:guillaumemichel"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "guillaumemichel"
    }

  # github_team_membership.this["shipyard:lidel"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "lidel"
    }

  # github_team_membership.this["shipyard:marcopolo"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "MarcoPolo"
    }

  # github_team_membership.this["shipyard:sukunrt"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "sukunrt"
    }

  # github_team_membership.this["shipyard:yiannisbot"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "yiannisbot"
    }

  # github_team_repository.this["admin:go-libp2p"] will be destroyed
  # (because key ["admin:go-libp2p"] is not in for_each map)
  - resource "github_team_repository" "this" {
      - etag       = "W/\"5cc0afb8c84d890d2ec579fc5b1327c244440dc85cdf33ede9a794acfb564513\"" -> null
      - id         = "2077192:go-libp2p" -> null
      - permission = "admin" -> null
      - repository = "go-libp2p" -> null
      - team_id    = "2077192" -> null
    }

  # github_team_repository.this["admin:js-libp2p"] will be destroyed
  # (because key ["admin:js-libp2p"] is not in for_each map)
  - resource "github_team_repository" "this" {
      - etag       = "W/\"c17e1967d74d9c28c1367a2d3e5d16153c5af6d4084bd3fd8feeb45294b4144a\"" -> null
      - id         = "2077192:js-libp2p" -> null
      - permission = "admin" -> null
      - repository = "js-libp2p" -> null
      - team_id    = "2077192" -> null
    }

  # github_team_repository.this["shipyard:go-libp2p"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "go-libp2p"
      + team_id    = (known after apply)
    }

  # github_team_repository.this["w3dt-stewards:go-libp2p"] will be destroyed
  # (because key ["w3dt-stewards:go-libp2p"] is not in for_each map)
  - resource "github_team_repository" "this" {
      - etag       = "W/\"5cc0afb8c84d890d2ec579fc5b1327c244440dc85cdf33ede9a794acfb564513\"" -> null
      - id         = "4657013:go-libp2p" -> null
      - permission = "admin" -> null
      - repository = "go-libp2p" -> null
      - team_id    = "4657013" -> null
    }

  # github_team_repository.this["w3dt-stewards:js-libp2p"] will be destroyed
  # (because key ["w3dt-stewards:js-libp2p"] is not in for_each map)
  - resource "github_team_repository" "this" {
      - etag       = "W/\"c17e1967d74d9c28c1367a2d3e5d16153c5af6d4084bd3fd8feeb45294b4144a\"" -> null
      - id         = "4657013:js-libp2p" -> null
      - permission = "admin" -> null
      - repository = "js-libp2p" -> null
      - team_id    = "4657013" -> null
    }

Plan: 17 to add, 0 to change, 4 to destroy.
```

</details>
<!-- Sticky Pull Request Commentplan -->